//嶺の字を書かせるプログラム
public class H21{
  public static void main(String[] args){
    int fromX[] = {200, 60, 60, 340, 115, 115, 60, 30, 170, 170, 90, 190, 280, 205, 205, 345, 205, 205, 205, 250, 300};
    int fromY[] = {30, 40, 90, 40, 110, 110, 190, 235, 235, 330, 235, 120, 120, 170, 170, 170,  210, 250, 290, 310, 310};
    int endX[] = {200, 60, 340, 340, 30, 180, 160, 170, 170, 120, 90, 370, 260, 205, 345, 345, 345, 345, 345, 180, 370};
    int endY[] = {90, 90, 90, 90, 195, 190, 190, 235, 330, 320, 360, 120, 170, 290, 170, 290, 210, 250, 290, 350, 350};
    TurtleFrame f = new TurtleFrame();
    Turtle m = new Turtle();
    f.add(m);
    m.speed(1);
    m.up();
    for(int i=0; i<22;i++){
      m.moveTo(fromX[i], fromY[i]);
      m.down();
      m.moveTo(endX[i], endY[i]);
      m.up();
    }
  }
}